231103-jax/readme.org
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:{} arch:headline
#+options: author:t broken-links:mark c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:1 todo:t |:t
#+title: JAX -- Now and Future
#+date: <2023-07-16 Sun>
#+author: Nasy
#+email: nasyxx@gmail.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 29.0.50 (Org mode 9.5.5)

* Introduction

** What is JAX?

*** Acronym

+ Originally :: Just After eXecution
+ Now :: JAX is Autograd (automatic obtaining of the gradient function
  through differentiation of a function) an XLA (accelerated linear
  algebra).
+ Fact :: JAX is JAX

ref: https://github.com/google/jax/discussions/9019

*** Design

+ Follow =numpy= as closely as possible
+ Works with various existing frameworks (PyTorch, Tensorflow)
+ Immutable and purely functional
+ Asynchronous dispatch
+ Core: ~jit~, ~vmap~, ~grad~, ~pmap~

** Who use JAX?

+ Lab
  - Google Brain & Deepmind
  - Google Research
+ Models
  - ViT
  - Big Vision
  - AlphaFold
  - MLP-Mixer
  - T5X
  - PaLM
  - ...
+ Awesome-jax: https://github.com/n2cholas/awesome-jax

** Basic Usage

*** JAX and NumPy

**** JAX is accelerated NumPy

#+BEGIN_SRC python :session jax :results output
  import jax
  import jax.numpy as jnp
  import numpy as np
  from rich import print

  print("numpy:", np.asarray([1, 2, 3]))
  print("jax:", jnp.asarray([1, 2, 3]))
#+END_SRC

#+RESULTS:
: numpy: [1 2 3]
: jax: [1 2 3]

#+begin_src python :session jax :results output
  print("jax->numpy:", np.std(jnp.arange(10)))
  print("numpy->jax:", jnp.std(np.arange(10)))
#+end_src

#+RESULTS:
: jax->numpy: 2.8722813
: numpy->jax: 2.8722813

**** Difference

JAX is designed to be functional, as in functional programming.

#+begin_src python :session jax :results output
  x = np.arange(10)
  jx = jnp.arange(10)
  print(f"Original: {x=}")
  x[0] = 1
  print(f"Inplace replace: {x=}")

  # cannot
  # jx[0] = 1
  jx = jx.at[0].set(1)


  def in_place_set(x, i, v):
      x[i] = v
      return x

  in_place_set(x, 2, 10)

  print(f"Inplace replace 2: {x=}")
#+end_src

#+RESULTS:
: Original: x=array([0, 1, 2, 3, 4, 5, 6, 7, 8, 9])
: Inplace replace: x=array([1, 1, 2, 3, 4, 5, 6, 7, 8, 9])
: Inplace replace 2: x=array([ 1,  1, 10,  3,  4,  5,  6,  7,  8,  9])

*** JIT

Using a just-in-time (JIT) compilation decorator, sequences of operations can be optimized together and run at once.

ref: https://jax.readthedocs.io/en/latest/_autosummary/jax.jit.html#jax.jit

ref2, tutorial: https://jax.readthedocs.io/en/latest/jax-101/02-jitting.html

Here is an example to JIT a function.

#+begin_src  python
  def func(x: Array) -> Array:
    ...

  jit_func = jax.jit(func)

  # or

  @jax.jit
  def func(x: Array) -> Array:
    ...
#+end_src

In most of time, you only need add the jit funciton in the outer most function.

#+begin_src python  :results output
  import jax
  import jax.numpy as jnp
  import rich
  import time

  def model(params, x):
    return params["w"] * x + params["b"]

  def loss_function(params, x, y):
    return ((model(params, x) - y) ** 2).mean()

  def train_step(params, x, y, lr):
    grads = jax.grad(loss_function)(params, x, y)
    return {"w": params["w"] - lr * grads["w"],
            "b": params["b"] - lr * grads["b"]}

  def train(x, y, lr, num_steps):
    params = {"w": 0.0, "b": 0.0}
    for i in range(num_steps):
      params = train_step(params, x, y, lr)
    return params


  train_step_jit = jax.jit(train_step)


  def train_jit(x, y, lr, num_steps):
    params = {"w": 0.0, "b": 0.0}
    for i in range(num_steps):
      params = train_step_jit(params, x, y, lr)
    return params


  xs = jnp.array([1, 2, 3, 4, 5]) / 2
  ys = jnp.array([2, 4, 6, 8, 10]) / 2

  t1 = time.time()
  p1 = train(xs, ys, 0.01, 50)
  t2 = time.time()

  t3 = time.time()
  p2 = train_jit(xs, ys, 0.01, 50)
  t4 = time.time()


  rich.print("no jit:", p1, t2 - t1)
  rich.print("jit:", p2, t4 - t3)
#+end_src

#+RESULTS:
#+begin_example
no jit:
{
    'w': Array(1.5326817, dtype=float32, weak_type=True),
    'b': Array(0.73161584, dtype=float32, weak_type=True)
}
0.21137738227844238
jit:
{
    'b': Array(0.73161584, dtype=float32, weak_type=True),
    'w': Array(1.5326817, dtype=float32, weak_type=True)
}
0.015442848205566406
#+end_example

*** autograd

JAX use =jax.grad= and =jax.value_and_grad= to get the gradient of a function.

#+begin_src python :session jax :results output
  def f(x):
    return x ** 3

  print(jax.grad(f)(10.0))  # 3x^2
  print(jax.value_and_grad(f)(10.0))  # (x^3, 3x^2)
  print(jax.grad(jax.grad(f))(10.0))  # (3x^2)' = 6x
#+end_src

#+RESULTS:
: 300.0
: (
:     Array(1000., dtype=float32, weak_type=True),
:     Array(300., dtype=float32, weak_type=True)
: )
: 60.0

You can also do partial differentiation with some structure data in JAX.

#+begin_src  python :session jax :results output
  def f(xy):
    return xy["x"] ** xy["y"]

  x = jnp.array(2.)
  y = jnp.array(3.)

  print(jax.value_and_grad(f)({"x": x, "y": y}))
  # Higher order derivatives
  print(jax.hessian(f)({"x": x, "y": y}))
#+end_src

#+RESULTS:
#+begin_example
(
    Array(8., dtype=float32, weak_type=True),
    {
        'x': Array(12., dtype=float32, weak_type=True),
        'y': Array(5.5451775, dtype=float32, weak_type=True)
    }
)
{
    'x': {
        'x': Array(12., dtype=float32, weak_type=True),
        'y': Array(12.317766, dtype=float32, weak_type=True)
    },
    'y': {
        'x': Array(12.317766, dtype=float32, weak_type=True),
        'y': Array(3.843624, dtype=float32, weak_type=True)
    }
}
#+end_example

*** vmap and pmap

JAX for single-program, multiple-data (SPMD).

~jax.vmap(f)(x)~, where the shape of =x= is =batch_size, ...=

Here is an example for =vmap=

#+begin_src python :session jax :results output
  # we want to calculate the gradient for x and y, however, our x and y is batched.
  @jax.grad
  def f2(xy):
    x, y = xy
    return x ** y

  xs = jnp.array([2., 2.])
  ys = jnp.array([3., 3.])

  # for-loop
  grads = []
  for x, y in zip(xs, ys):
    grads.append(f2((x, y)))
  print("For-loop:", grads)

  # vmap
  vmap_grads = jax.vmap(f2)
  print("vmap:", vmap_grads((xs, ys)))
#+end_src

#+RESULTS:
: For-loop:
: [
:     (Array(12., dtype=float32), Array(5.5451775, dtype=float32)),
:     (Array(12., dtype=float32), Array(5.5451775, dtype=float32))
: ]
: vmap:
: (Array([12., 12.], dtype=float32), Array([5.5451775, 5.5451775], dtype=float32))

How about =pmap=?

=pmap= is like =vmap=, but parallel evaluate the function on different devices.

~jax.pmap(f)(x)~, where the shape of =x= is =devices, ...=

And you can use both =pmap= and =vmap=, like ~jax.pmap(jax.vmap(f))~ the shape will be =devices, batch_size, ...=

*** Performance

Here is a comparison between numpy, jax and pytorch.

#+begin_src python :session jax :results output
  import time
  import torch
  np.random.seed(42)

  arr = np.random.random(1000000).reshape(-1, 1000).astype("float32") * 10
  jrr = jnp.array(arr)

  def _func(x):
    return x @ x @ x @ x @ x @ x @ x @ x @ x @ x @ x

  def func(x):
    return (_func(x) * _func(x) + _func(x) * _func(x)) / _func(x)

  import time

  # numpy time
  t1 = time.time()
  func(arr)
  t2 = time.time()

  # jax time
  t3 = time.time()
  func(jrr).block_until_ready()
  t4 = time.time()

  # jax jit compile
  jit_func = jax.jit(func)
  jit_func(jrr).block_until_ready()

  # jax jit time
  t5 = time.time()
  jit_func(jrr).block_until_ready()
  t6 = time.time()

  trr = torch.from_numpy(arr)

  # torch time
  func(trr)
  t7 = time.time()
  func(trr)
  t8 = time.time()

  print("Numpy time: ", t2 - t1)
  print("Jax time: ", t4 - t3)
  print("Jax jit time: ", t6 - t5)
  print("Torch time: ", t8 - t7)
#+end_src

#+RESULTS:
: Numpy time:  0.9135739803314209
: Jax time:  0.41330528259277344
: Jax jit time:  0.03363919258117676
: Torch time:  0.058039188385009766

* JAX vs PyTorch in a Pipeline

