231103-jax/readme.tex
% Created 2023-11-10 Fri 15:54
% Intended LaTeX compiler: xelatex
\documentclass[11pt]{article}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{booktabs}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{nicefrac}
\usepackage[dvipsnames]{xcolor}
\usepackage[colorlinks,unicode,linkcolor=violet,anchorcolor=BlueViolet,citecolor=YellowOrange,filecolor=black,urlcolor=Aquamarine]{hyperref}
\author{Nasy}
\date{Jul 16, 2023}
\title{JAX -- Now and Future}
\hypersetup{
 pdfauthor={Nasy},
 pdftitle={JAX -- Now and Future},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.0.50 (Org mode 9.5.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\setcounter{tocdepth}{1}
\tableofcontents

\section{Introduction}
\label{sec:org0383752}

\subsection{What is JAX?}
\label{sec:org3e21860}

\subsubsection{Acronym}
\label{sec:org8ac9489}

\begin{description}
\item[{Originally}] Just After eXecution
\item[{Now}] JAX is Autograd (automatic obtaining of the gradient function
through differentiation of a function) an XLA (accelerated linear
algebra).
\item[{Fact}] JAX is JAX
\end{description}

ref: \url{https://github.com/google/jax/discussions/9019}
\subsubsection{Design}
\label{sec:orgcbf11fa}

\begin{itemize}
\item Follow \texttt{numpy} as closely as possible
\item Works with various existing frameworks (PyTorch, Tensorflow)
\item Immutable and purely functional
\item Asynchronous dispatch
\item Core: \texttt{jit}, \texttt{vmap}, \texttt{grad}, \texttt{pmap}
\end{itemize}
\subsection{Who use JAX?}
\label{sec:org180bc9b}

\begin{itemize}
\item Lab
\begin{itemize}
\item Google Brain \& Deepmind
\item Google Research
\end{itemize}
\item Models
\begin{itemize}
\item ViT
\item Big Vision
\item AlphaFold
\item MLP-Mixer
\item T5X
\item PaLM
\item \ldots{}
\end{itemize}
\item Awesome-jax: \url{https://github.com/n2cholas/awesome-jax}
\end{itemize}
\subsection{Basic Usage}
\label{sec:org09dd7e7}

\subsubsection{JAX and NumPy}
\label{sec:orgfad4f47}

\begin{enumerate}
\item JAX is accelerated NumPy
\label{sec:org9960215}

\begin{minted}[]{python}
import jax
import jax.numpy as jnp
import numpy as np
from rich import print

print("numpy:", np.asarray([1, 2, 3]))
print("jax:", jnp.asarray([1, 2, 3]))
\end{minted}

\begin{minted}[]{python}
print("jax->numpy:", np.std(jnp.arange(10)))
print("numpy->jax:", jnp.std(np.arange(10)))
\end{minted}
\item Difference
\label{sec:org2fd820a}

JAX is designed to be functional, as in functional programming.

\begin{minted}[]{python}
x = np.arange(10)
jx = jnp.arange(10)
print(f"Original: {x=}")
x[0] = 1
print(f"Inplace replace: {x=}")

# cannot
# jx[0] = 1
jx = jx.at[0].set(1)


def in_place_set(x, i, v):
    x[i] = v
    return x

in_place_set(x, 2, 10)

print(f"Inplace replace 2: {x=}")
\end{minted}
\end{enumerate}
\subsubsection{JIT}
\label{sec:org35dc3f9}

Using a just-in-time (JIT) compilation decorator, sequences of operations can be optimized together and run at once.

ref: \url{https://jax.readthedocs.io/en/latest/\_autosummary/jax.jit.html\#jax.jit}

ref2, tutorial: \url{https://jax.readthedocs.io/en/latest/jax-101/02-jitting.html}

Here is an example to JIT a function.

\begin{minted}[]{python}
def func(x: Array) -> Array:
  ...

jit_func = jax.jit(func)

# or

@jax.jit
def func(x: Array) -> Array:
  ...
\end{minted}

In most of time, you only need add the jit funciton in the outer most function.

\begin{minted}[]{python}
import jax
import jax.numpy as jnp
import rich
import time

def model(params, x):
  return params["w"] * x + params["b"]

def loss_function(params, x, y):
  return ((model(params, x) - y) ** 2).mean()

def train_step(params, x, y, lr):
  grads = jax.grad(loss_function)(params, x, y)
  return {"w": params["w"] - lr * grads["w"],
          "b": params["b"] - lr * grads["b"]}

def train(x, y, lr, num_steps):
  params = {"w": 0.0, "b": 0.0}
  for i in range(num_steps):
    params = train_step(params, x, y, lr)
  return params


train_step_jit = jax.jit(train_step)


def train_jit(x, y, lr, num_steps):
  params = {"w": 0.0, "b": 0.0}
  for i in range(num_steps):
    params = train_step_jit(params, x, y, lr)
  return params


xs = jnp.array([1, 2, 3, 4, 5]) / 2
ys = jnp.array([2, 4, 6, 8, 10]) / 2

t1 = time.time()
p1 = train(xs, ys, 0.01, 50)
t2 = time.time()

t3 = time.time()
p2 = train_jit(xs, ys, 0.01, 50)
t4 = time.time()


rich.print("no jit:", p1, t2 - t1)
rich.print("jit:", p2, t4 - t3)
\end{minted}
\subsubsection{autograd}
\label{sec:orgc32fa7d}

JAX use \texttt{jax.grad} and \texttt{jax.value\_and\_grad} to get the gradient of a function.

\begin{minted}[]{python}
def f(x):
  return x ** 3

print(jax.grad(f)(10.0))  # 3x^2
print(jax.value_and_grad(f)(10.0))  # (x^3, 3x^2)
print(jax.grad(jax.grad(f))(10.0))  # (3x^2)' = 6x
\end{minted}

You can also do partial differentiation with some structure data in JAX.

\begin{minted}[]{python}
def f(xy):
  return xy["x"] ** xy["y"]

x = jnp.array(2.)
y = jnp.array(3.)

print(jax.value_and_grad(f)({"x": x, "y": y}))
# Higher order derivatives
print(jax.hessian(f)({"x": x, "y": y}))
\end{minted}
\subsubsection{vmap and pmap}
\label{sec:org2791a97}

JAX for single-program, multiple-data (SPMD).

\texttt{jax.vmap(f)(x)}, where the shape of \texttt{x} is \texttt{batch\_size, ...}

Here is an example for \texttt{vmap}

\begin{minted}[]{python}
# we want to calculate the gradient for x and y, however, our x and y is batched.
@jax.grad
def f2(xy):
  x, y = xy
  return x ** y

xs = jnp.array([2., 2.])
ys = jnp.array([3., 3.])

# for-loop
grads = []
for x, y in zip(xs, ys):
  grads.append(f2((x, y)))
print("For-loop:", grads)

# vmap
vmap_grads = jax.vmap(f2)
print("vmap:", vmap_grads((xs, ys)))
\end{minted}

How about \texttt{pmap}?

\texttt{pmap} is like \texttt{vmap}, but parallel evaluate the function on different devices.

\texttt{jax.pmap(f)(x)}, where the shape of \texttt{x} is \texttt{devices, ...}

And you can use both \texttt{pmap} and \texttt{vmap}, like \texttt{jax.pmap(jax.vmap(f))} the shape will be \texttt{devices, batch\_size, ...}
\subsubsection{Performance}
\label{sec:org701dd44}

Here is a comparison between numpy, jax and pytorch.

\begin{minted}[]{python}
import time
import torch
np.random.seed(42)

arr = np.random.random(1000000).reshape(-1, 1000).astype("float32") * 10
jrr = jnp.array(arr)

def _func(x):
  return x @ x @ x @ x @ x @ x @ x @ x @ x @ x @ x

def func(x):
  return (_func(x) * _func(x) + _func(x) * _func(x)) / _func(x)

import time

# numpy time
t1 = time.time()
func(arr)
t2 = time.time()

# jax time
t3 = time.time()
func(jrr).block_until_ready()
t4 = time.time()

# jax jit compile
jit_func = jax.jit(func)
jit_func(jrr).block_until_ready()

# jax jit time
t5 = time.time()
jit_func(jrr).block_until_ready()
t6 = time.time()

trr = torch.from_numpy(arr)

# torch time
func(trr)
t7 = time.time()
func(trr)
t8 = time.time()

print("Numpy time: ", t2 - t1)
print("Jax time: ", t4 - t3)
print("Jax jit time: ", t6 - t5)
print("Torch time: ", t8 - t7)
\end{minted}
\section{JAX vs PyTorch in a Pipeline}
\label{sec:org9c3562a}
