231103-jax/readme.org
** Keras

Those who have previously used TensorFlow should be quite familiar with Keras. Currently, Keras has reached version 3.0 and includes the 'keras-core' library, which allows for very easy switching between JAX, TensorFlow, and PyTorch.

#+begin_src sh
  # run with jax
  KERAS_BACKEND=jax python train.py

  # run with torch
  KERAS_BACKEND=torch python train.py

  # run with tensorflow
  KERAS_BACKEND=tensorflow python train.py
#+end_src

** Install and run

Install

#+begin_src sh
  # jax
  pip install --upgrade "jaxlib[cuda12_pip]" "jax[cuda12_pip]" -f https://storage.googleapis.com/jax-releases/jax_cuda_releases.html
  # jax nn library
  pip install flax

  # torch
  pip install torch
#+end_src

Run.  As far as I know, both =JAX= and =PyTorch= now ship with nvidia-cuda-toolkits, so you do not need to setup =LD_LIBRARY_PATH= anymore.

#+begin_src sh
  # jax
  python train.py

  # torch
  python train.py
#+end_src

** Load data

JAX does not have built-in data loading utilities, so we can use both =tensorflow= or =torch= dataloader to load the dataset.

Here is a example for =torch= dataloader.

#+begin_src python
  import jax.numpy as jnp
  from jax.tree_util import tree_map
  from torch.utils import data

  def collate_fn(x):
    return tree_map(jnp.asarray, data.default_collate(batch))

  data_generator = Dataloader(
      dataset,
      collate_fn=collate_fn,
      batch_size=128,
      shuffle=False,
      num_workers=2,
  )
#+end_src

And you can find others in the =jax= document.  https://jax.readthedocs.io/en/latest/advanced_guide.html

** Define and initialize model

*** PyTorch

#+begin_src python :session jax :results output
  import torch
  from torch import nn

  class TM(nn.Module):
    """Torch Model."""

    def __init__(self, in_=100, h1=300, h2=200, h3=100):
      super().__init__()
      self.l1 = nn.Linear(in_, h1)
      self.bn1 = nn.BatchNorm1d(h1)
      self.dp1 = nn.Dropout(0.5)
      self.l2 = nn.Linear(h1, h2)
      self.l3 = nn.Linear(h2, h3)
      self.out = nn.Linear(h3, 1)


    def forward(self, x):
      x = torch.relu(self.l1(x))
      x = self.bn1(x)
      x = self.dp1(x)
      x = torch.relu(self.l2(x))
      x = torch.relu(self.l3(x))
      return self.out(x)

  tm = TM()
  print(tm)
  rich.print(jax.tree_map(lambda x: x.shape, dict(tm.state_dict())))
#+end_src

#+RESULTS:
#+begin_example
TM(
  (l1): Linear(in_features=100, out_features=300, bias=True)
  (bn1): BatchNorm1d(300, eps=1e-05, momentum=0.1, affine=True,
track_running_stats=True)
  (dp1): Dropout(p=0.5, inplace=False)
  (l2): Linear(in_features=300, out_features=200, bias=True)
  (l3): Linear(in_features=200, out_features=100, bias=True)
  (out): Linear(in_features=100, out_features=1, bias=True)
)
{
    'bn1.bias': torch.Size([300]),
    'bn1.num_batches_tracked': torch.Size([]),
    'bn1.running_mean': torch.Size([300]),
    'bn1.running_var': torch.Size([300]),
    'bn1.weight': torch.Size([300]),
    'l1.bias': torch.Size([300]),
    'l1.weight': torch.Size([300, 100]),
    'l2.bias': torch.Size([200]),
    'l2.weight': torch.Size([200, 300]),
    'l3.bias': torch.Size([100]),
    'l3.weight': torch.Size([100, 200]),
    'out.bias': torch.Size([1]),
    'out.weight': torch.Size([1, 100])
}
#+end_example

*** JAX w/ flax

#+begin_src python :session jax :results output
  import jax
  import jax.numpy as jnp
  from flax import linen

  class JM(linen.Module):
      """JAX and flax model."""

      h1 = 300
      h2 = 200
      h3 = 100

      @linen.compact
      def __call__(self, x, training=True):
          x = linen.Dense(self.h1)(x)
          x = linen.BatchNorm()(x, use_running_average=not training)
          x = linen.Dropout(0.2)(x, deterministic=not training)
          x = jax.nn.relu(x)
          x = linen.Dense(self.h2)(x)
          x = jax.nn.relu(x)
          x = linen.Dense(self.h3)(x)
          x = jax.nn.relu(x)
          x = linen.Dense(1)(x)
          return x


  jm = JM()
  variables = jm.init(
      jax.random.key(42),  # random key
      jnp.ones((1, 100)),  # input (Batch, Features)
      training=False,  # training mode
  )

  rich.print(jax.tree_map(lambda x: x.shape, variables))
  print(jm.tabulate(jax.random.key(42), jnp.ones((1, 100)), training=False,
                    compute_flops=True, compute_vjp_flops=True))
#+end_src

#+RESULTS:
#+begin_example
{
    'batch_stats': {'BatchNorm_0': {'mean': (300,), 'var': (300,)}},
    'params': {
        'BatchNorm_0': {'bias': (300,), 'scale': (300,)},
        'Dense_0': {'bias': (300,), 'kernel': (100, 300)},
        'Dense_1': {'bias': (200,), 'kernel': (300, 200)},
        'Dense_2': {'bias': (100,), 'kernel': (200, 100)},
        'Dense_3': {'bias': (1,), 'kernel': (100, 1)}
    }
}

                                   JM Summary
┏━━━━━━━━━┳━━━━━━━━━┳━━━━━━━━━┳━━━━━━━━━┳━━━━━━━━┳━━━━━━━━━┳━━━━━━━━━┳━━━━━━━━━┓
┃ path    ┃ module  ┃ inputs  ┃ outputs ┃ flops  ┃ vjp_fl… ┃ params  ┃ batch_… ┃
┡━━━━━━━━━╇━━━━━━━━━╇━━━━━━━━━╇━━━━━━━━━╇━━━━━━━━╇━━━━━━━━━╇━━━━━━━━━╇━━━━━━━━━┩
│         │ JM      │ -       │ float3… │ 222901 │ 778802  │         │         │
│         │         │ float3… │         │        │         │         │         │
│         │         │ -       │         │        │         │         │         │
│         │         │ traini… │         │        │         │         │         │
│         │         │ False   │         │        │         │         │         │
├─────────┼─────────┼─────────┼─────────┼────────┼─────────┼─────────┼─────────┤
│ Dense_0 │ Dense   │ float3… │ float3… │ 60300  │ 210600  │ bias:   │         │
│         │         │         │         │        │         │ float3… │         │
│         │         │         │         │        │         │ kernel: │         │
│         │         │         │         │        │         │ float3… │         │
│         │         │         │         │        │         │         │         │
│         │         │         │         │        │         │ 30,300  │         │
│         │         │         │         │        │         │ (121.2  │         │
│         │         │         │         │        │         │ KB)     │         │
├─────────┼─────────┼─────────┼─────────┼────────┼─────────┼─────────┼─────────┤
│ BatchN… │ BatchN… │ -       │ float3… │ 1500   │ 5100    │ bias:   │ mean:   │
│         │         │ float3… │         │        │         │ float3… │ float3… │
│         │         │ -       │         │        │         │ scale:  │ var:    │
│         │         │ use_ru… │         │        │         │ float3… │ float3… │
│         │         │ True    │         │        │         │         │         │
│         │         │         │         │        │         │ 600     │ 600     │
│         │         │         │         │        │         │ (2.4    │ (2.4    │
│         │         │         │         │        │         │ KB)     │ KB)     │
├─────────┼─────────┼─────────┼─────────┼────────┼─────────┼─────────┼─────────┤
│ Dropou… │ Dropout │ -       │ float3… │ 0      │ 0       │         │         │
│         │         │ float3… │         │        │         │         │         │
│         │         │ -       │         │        │         │         │         │
│         │         │ determ… │         │        │         │         │         │
│         │         │ True    │         │        │         │         │         │
├─────────┼─────────┼─────────┼─────────┼────────┼─────────┼─────────┼─────────┤
│ Dense_1 │ Dense   │ float3… │ float3… │ 120200 │ 420400  │ bias:   │         │
│         │         │         │         │        │         │ float3… │         │
│         │         │         │         │        │         │ kernel: │         │
│         │         │         │         │        │         │ float3… │         │
│         │         │         │         │        │         │         │         │
│         │         │         │         │        │         │ 60,200  │         │
│         │         │         │         │        │         │ (240.8  │         │
│         │         │         │         │        │         │ KB)     │         │
├─────────┼─────────┼─────────┼─────────┼────────┼─────────┼─────────┼─────────┤
│ Dense_2 │ Dense   │ float3… │ float3… │ 40100  │ 140200  │ bias:   │         │
│         │         │         │         │        │         │ float3… │         │
│         │         │         │         │        │         │ kernel: │         │
│         │         │         │         │        │         │ float3… │         │
│         │         │         │         │        │         │         │         │
│         │         │         │         │        │         │ 20,100  │         │
│         │         │         │         │        │         │ (80.4   │         │
│         │         │         │         │        │         │ KB)     │         │
├─────────┼─────────┼─────────┼─────────┼────────┼─────────┼─────────┼─────────┤
│ Dense_3 │ Dense   │ float3… │ float3… │ 201    │ 702     │ bias:   │         │
│         │         │         │         │        │         │ float3… │         │
│         │         │         │         │        │         │ kernel: │         │
│         │         │         │         │        │         │ float3… │         │
│         │         │         │         │        │         │         │         │
│         │         │         │         │        │         │ 101     │         │
│         │         │         │         │        │         │ (404 B) │         │
├─────────┼─────────┼─────────┼─────────┼────────┼─────────┼─────────┼─────────┤
│         │         │         │         │        │   Total │ 111,301 │ 600     │
│         │         │         │         │        │         │ (445.2  │ (2.4    │
│         │         │         │         │        │         │ KB)     │ KB)     │
└─────────┴─────────┴─────────┴─────────┴────────┴─────────┴─────────┴─────────┘

                      Total Parameters: 111,901 (447.6 KB)
#+end_example

** TrainState and Train loop

Usually, we need to store the state of the model, like the parameters, the optimizer, the learning rate scheduler, etc.

