231103-jax/readme.tex

\subsection{Keras}
\label{sec:org86c6d78}

Those who have previously used TensorFlow should be quite familiar with Keras. Currently, Keras has reached version 3.0 and includes the 'keras-core' library, which allows for very easy switching between JAX, TensorFlow, and PyTorch.

\begin{minted}[]{sh}
# run with jax
KERAS_BACKEND=jax python train.py

# run with torch
KERAS_BACKEND=torch python train.py

# run with tensorflow
KERAS_BACKEND=tensorflow python train.py
\end{minted}
\subsection{Install and run}
\label{sec:org8282286}

Install

\begin{minted}[]{sh}
# jax
pip install --upgrade "jaxlib[cuda12_pip]" "jax[cuda12_pip]" -f https://storage.googleapis.com/jax-releases/jax_cuda_releases.html
# jax nn library
pip install flax

# torch
pip install torch
\end{minted}

Run.  As far as I know, both \texttt{JAX} and \texttt{PyTorch} now ship with nvidia-cuda-toolkits, so you do not need to setup \texttt{LD\_LIBRARY\_PATH} anymore.

\begin{minted}[]{sh}
# jax
python train.py

# torch
python train.py
\end{minted}
\subsection{Load data}
\label{sec:orga4151ce}

JAX does not have built-in data loading utilities, so we can use both \texttt{tensorflow} or \texttt{torch} dataloader to load the dataset.

Here is a example for \texttt{torch} dataloader.

\begin{minted}[]{python}
import jax.numpy as jnp
from jax.tree_util import tree_map
from torch.utils import data

def collate_fn(x):
  return tree_map(jnp.asarray, data.default_collate(batch))

data_generator = Dataloader(
    dataset,
    collate_fn=collate_fn,
    batch_size=128,
    shuffle=False,
    num_workers=2,
)
\end{minted}

And you can find others in the \texttt{jax} document.  \url{https://jax.readthedocs.io/en/latest/advanced\_guide.html}
\subsection{Define and initialize model}
\label{sec:org874c6d3}

\subsubsection{PyTorch}
\label{sec:orgc788179}

\begin{minted}[]{python}
import torch
from torch import nn

class TM(nn.Module):
  """Torch Model."""

  def __init__(self, in_=100, h1=300, h2=200, h3=100):
    super().__init__()
    self.l1 = nn.Linear(in_, h1)
    self.bn1 = nn.BatchNorm1d(h1)
    self.dp1 = nn.Dropout(0.5)
    self.l2 = nn.Linear(h1, h2)
    self.l3 = nn.Linear(h2, h3)
    self.out = nn.Linear(h3, 1)


  def forward(self, x):
    x = torch.relu(self.l1(x))
    x = self.bn1(x)
    x = self.dp1(x)
    x = torch.relu(self.l2(x))
    x = torch.relu(self.l3(x))
    return self.out(x)

tm = TM()
print(tm)
rich.print(jax.tree_map(lambda x: x.shape, dict(tm.state_dict())))
\end{minted}
\subsubsection{JAX w/ flax}
\label{sec:org91228eb}

\begin{minted}[]{python}
import jax
import jax.numpy as jnp
from flax import linen

class JM(linen.Module):
    """JAX and flax model."""

    h1 = 300
    h2 = 200
    h3 = 100

    @linen.compact
    def __call__(self, x, training=True):
        x = linen.Dense(self.h1)(x)
        x = linen.BatchNorm()(x, use_running_average=not training)
        x = linen.Dropout(0.2)(x, deterministic=not training)
        x = jax.nn.relu(x)
        x = linen.Dense(self.h2)(x)
        x = jax.nn.relu(x)
        x = linen.Dense(self.h3)(x)
        x = jax.nn.relu(x)
        x = linen.Dense(1)(x)
        return x


jm = JM()
variables = jm.init(
    jax.random.key(42),  # random key
    jnp.ones((1, 100)),  # input (Batch, Features)
    training=False,  # training mode
)

rich.print(jax.tree_map(lambda x: x.shape, variables))
print(jm.tabulate(jax.random.key(42), jnp.ones((1, 100)), training=False,
                  compute_flops=True, compute_vjp_flops=True))
\end{minted}
\subsection{TrainState and Train loop}
\label{sec:org17f69eb}

Usually, we need to store the state of the model, like the parameters, the optimizer, the learning rate scheduler, etc.
