231103-jax/readme.tex
\subsubsection{PyTorch}
\label{sec:org903e14a}

\begin{minted}[]{python}
import torch
import torch.nn as nn
from typing import NamedTuple


def train_loop(conf: dict, dataloader):
  """The pytorch training loop."""
  model = TM(conf)

  loss_fn = nn.CrossEntropyLoss()

  optim = torch.optim.Adam(model.parameters(), lr=conf["lr"])

  state = TrainState(
    loss=0,
    state=model.state_dict(),
    optim_state=optim.state_dict(),
    step=0,
    metric=0,
  )

  model.to("cuda")

  def train_step(batch, ys):
    batch, ys = batch.to("cuda"), ys.to("cuda")

    # forward
    loss = loss_fn(model(batch), ys)
    # grad
    loss.backward()
    # update params
    optim.step()
    optim.zero_grad()

    return loss


  for e in range(conf["epochs"]):
    model.train()
    for i, (batch, ys) in dataloader:
      loss = train_step(batch, ys)

      # eval
      model.eval()
      metric = ...  # compute metric

      state = state._replace(
        loss=loss.item(),
        state=model.state_dict(),
        optim_state=optim.state_dict(),
        step=state.step + 1,
        metric=metric,
      )

  # save
  torch.save(state, "model.pt")
\end{minted}
\subsubsection{JAX}
\label{sec:org157b54a}

\begin{minted}[]{python}
import jax
import jax.numpy as jnp
import optax
from flax.core.scope import Collection
from flax.training import train_state
import pickle

class TrainState(train_state.TrainState):
    """Training states."""

    # default
    # apply_fn  # the model forward function
    # params
    # tx  # optim
    # step  # training step

    # our custom
    batch_stats: Collection
    # our metrics
    loss: jax.Array
    metric: jax.Array


def create_train_state(conf: dict):
    """Create initial training state."""
    model = JM(conf)

    @jax.jit
    def init() -> Collection:
        return model.init(jax.random.key(42), jnp.ones((1, 100)), training=False)

    variables = init()

    return TrainState.create(
        apply_fn=model.apply,
        params=variables["params"],
        tx=optax.adamw(conf["lr"]),
        model_state=Collection({}),
        loss=jnp.inf,
        metric=0.0,
        batch_stats=variables["batch_stats"],
        step=0,
    )


@jax.jit
def train_step(state, rng, batch, ys):

  @jax.jit  # optional since we already have jit outside train_step
  @jax.value_and_grad
  def lossfn(params):
    return optax.cross_entropy_loss(
        state.apply_fn(
            {
                "params": state.params,
                "batch_stats": state.batch_stats,
            },
            batch,
            training=True,
            rngs={"dropout": rng},
            mutable=["batch_stats"],
        ),
        ys,
    ).mean()

  loss, grad = lossfn(state.params)
  # the step, params, tx_states will automatically be updated
  return state.apply_gradients(grad=grad, loss=loss)


@jax.jit
def eval_step(state, batch, ys):

  value = state.apply_fn(
    {"params": state.params, "batch_stats": state.batch_stats},
    batch,
    training=False,
  )
  metric = ...
  return metric


def train_loop(conf: dict, dataloader):
    """Training loop."""
    state = create_train_state(conf)

    for epoch in range(conf["epochs"]):
        for batch, ys in dataloader:
            state = train_step(state, batch)

            # eval
            metric = eval_step(state, batch, ys)
            state = state.replace(metric=metric)

    # save
    with open("model.pkl", "wb") as f:
      pickle.dump({"params": state.params,
                   "tx": state.tx,
                   "batch_stats": state.batch_stats,
                   "metric": state.metric},
                  f)
\end{minted}
\section{Parallel and Distributed Computing}
\label{sec:orga00c272}

\subsection{Resource}
\label{sec:org2bfab64}

\begin{itemize}
\item Flax tutorial: \url{https://flax.readthedocs.io/en/latest/guides/parallel\_training/index.html}
\item JAX tutorial: \url{https://jax.readthedocs.io/en/latest/notebooks/Distributed\_arrays\_and\_automatic\_parallelization.html}
\end{itemize}
\subsection{Transfer data between devices}
\label{sec:orgbdfc8be}

\begin{minted}[]{python}
import jax
import jax.numpy as jnp
import os

os.environ["XLA_FLAGS"] = "--xla_force_host_platform_device_count=8"

x = jnp.ones((8, 8))

#1. check devices
print("global devices:", jax.devices())
print("local devices:", jax.local_devices())
# you can specify the device type
print("cpu devices:", jax.devices("cpu"))

#2. check the device of x
print("x devices:", x.devices())

# Put x to a specific device
y = jax.device_put(x, jax.devices("cpu")[1])
# Get y back to host (numpy array)
z = jax.device_get(y)
print("x devices:", x.devices())
print("y devices:", y.devices())
print("z type:", type(z))
\end{minted}
\subsection{Use \texttt{pmap} to train with data parallel.}
\label{sec:org39d0cb6}

\begin{minted}[]{python}
import jax
from functools import partial


@partial(jax.pmap, static_broadcasted_argnums=(0,))
def create_train_state(conf: dict):
    """Create initial training state."""
    ...


@jax.pmap
def train_step(state, rng, batch, ys):
    ...


@jax.jit
def eval_step(state, batch, ys):

  preds = state.apply_fn(  # (batch, 1)
    {"params": state.params, "batch_stats": state.batch_stats},
    batch,
    training=False,
  )
  logits = jax.nn.sigmoid(preds)
  acc = jnp.mean((logits > 0.5) == ys)
  return acc


@partial(jax.pmap, axis_name="batch")
def eval_step_pmap(state, batch, ys):

  preds = state.apply_fn(  # (devices, batch, 1)
    {"params": state.params, "batch_stats": state.batch_stats},
    batch,
    training=False,
  )
  logits = jax.nn.sigmoid(preds)
  pacc = jax.lax.pmean((logits > 0.5) == ys, axis_name="batch")
  acc = jnp.mean(pacc)
  return acc
\end{minted}
\subsection{Use jit with sharding.}
\label{sec:orgbe40ff0}

sharding, split a large array into smaller pieces, and each piece is stored on a different device.
\subsubsection{Basic}
\label{sec:org05c8698}

\begin{minted}[]{python}
import jax
import jax.numpy as jnp
from jax.experimental import mesh_utils
from jax.sharding import PositionalSharding, NamedSharding
import numpy as np

import os

os.environ["XLA_FLAGS"] = "--xla_force_host_platform_device_count=8"

dc = jax.device_count()
print(f"we have {dc} devices.")

# If you want to track gpu usage
# install go
# pip install jax-smi
# from jax_smi import initialise_tracking
# initialise_tracking()

# batch feature (batch, feature), here batch = Nxdevice_count
xs = jax.random.normal(jax.random.key(42), (8*dc*64, 8*dc*64))

# dmesh
dmesh = mesh_utils.create_device_mesh((dc,))
# or
dmesh = np.asarray(jax.devices()).reshape((dc,))

sharding = PositionalSharding(dmesh)

# since xs shappe is (batch, feature)
sharding = sharding.reshape((-1, 1))
# put jax across devices
print(xs.devices())
xs = jax.device_put(xs, sharding)
print(xs.devices())

jax.debug.visualize_array_sharding(xs)
\end{minted}
