231103-jax/readme.org
*** Different shardings

#+begin_src python :session jaxp :results output
  xs = jax.device_put(xs, sharding.reshape(1, -1))

  jax.debug.visualize_array_sharding(xs)
#+end_src

#+RESULTS:
#+begin_example
┌───────┬───────┬───────┬───────┬───────┬───────┬───────┬───────┐
│       │       │       │       │       │       │       │       │
│       │       │       │       │       │       │       │       │
│       │       │       │       │       │       │       │       │
│       │       │       │       │       │       │       │       │
│ CPU 0 │ CPU 1 │ CPU 2 │ CPU 3 │ CPU 4 │ CPU 5 │ CPU 6 │ CPU 7 │
│       │       │       │       │       │       │       │       │
│       │       │       │       │       │       │       │       │
│       │       │       │       │       │       │       │       │
│       │       │       │       │       │       │       │       │
└───────┴───────┴───────┴───────┴───────┴───────┴───────┴───────┘
#+end_example

#+begin_src python :session jaxp :results output
  xs = jax.device_put(xs, sharding.reshape(dc // 2, -1))
  jax.debug.visualize_array_sharding(xs)
#+end_src

#+RESULTS:
: ┌──────────┬──────────┐
: │  CPU 0   │  CPU 1   │
: ├──────────┼──────────┤
: │  CPU 2   │  CPU 3   │
: ├──────────┼──────────┤
: │  CPU 4   │  CPU 5   │
: ├──────────┼──────────┤
: │  CPU 6   │  CPU 7   │
: └──────────┴──────────┘

*** Performance

#+begin_src python :session jaxp :results output
  xs = jax.device_put(xs, sharding.reshape(dc // 2, -1))
  xsc0 = jax.device_put(xs, jax.devices()[0])
  import time

  cos = jax.jit(jnp.cos)
  cos(xsc0).block_until_ready()
  cos(xs).block_until_ready()

  t1 = time.time()
  for _ in range(20):
    r = cos(xsc0).block_until_ready()
  t2 = time.time()

  t3 = time.time()
  for _ in range(20):
    rr = cos(xs).block_until_ready()
  t4 = time.time()

  cos = jax.pmap(jnp.cos)

  pxs = xsc0.reshape(dc, -1, xsc0.shape[-1])

  t5 = time.time()
  for _ in range(20):
    rrr = cos(pxs).block_until_ready()
  t6 = time.time()

  print("In single device: ", t2 - t1)
  print("In multi device: ", t4 - t3)
  print("In multi device pmap: ", t6 - t5)
#+end_src

#+RESULTS:
: In single device:  0.5627968311309814
: In multi device:  0.3160829544067383
: In multi device pmap:  0.4480609893798828

*** Use sharding with =jit=

#+begin_src python :session jaxp :results output
  xs = jax.device_put(xs, sharding.reshape(dc, -1))

  def f(x):
    return jnp.sin(x)


  # in with None, out with (dc, 1)

  print("before:")
  jax.debug.visualize_array_sharding(xs)

  out = jax.jit(f, in_shardings=sharding.reshape(dc, -1), out_shardings=sharding.reshape(-1, dc))(xs)
  print("after:")
  jax.debug.visualize_array_sharding(out)
#+end_src

#+RESULTS:
#+begin_example
before:
┌───────────────────────┐
│         CPU 0         │
├───────────────────────┤
│         CPU 1         │
├───────────────────────┤
│         CPU 2         │
├───────────────────────┤
│         CPU 3         │
├───────────────────────┤
│         CPU 4         │
├───────────────────────┤
│         CPU 5         │
├───────────────────────┤
│         CPU 6         │
├───────────────────────┤
│         CPU 7         │
└───────────────────────┘
after:
┌───────┬───────┬───────┬───────┬───────┬───────┬───────┬───────┐
│       │       │       │       │       │       │       │       │
│       │       │       │       │       │       │       │       │
│       │       │       │       │       │       │       │       │
│       │       │       │       │       │       │       │       │
│ CPU 0 │ CPU 1 │ CPU 2 │ CPU 3 │ CPU 4 │ CPU 5 │ CPU 6 │ CPU 7 │
│       │       │       │       │       │       │       │       │
│       │       │       │       │       │       │       │       │
│       │       │       │       │       │       │       │       │
│       │       │       │       │       │       │       │       │
└───────┴───────┴───────┴───────┴───────┴───────┴───────┴───────┘
#+end_example

* JAX echosystem

+ JAX
+ NN library
  - Flax  (Google)
  - Haiku  (Deepmind)
  - Trax  (Google brain)
  - HuggingFace (Flax)
  - keras
  - jraph  (GNN)
  - RLax (Deepmind, RL)
  - Coax (Microsoft, RL)
+ Optimizer
  - jaxopt
  - optax
+ Others
  - orbax-checkpoint
  - jax-md  (molecular dynamics)
  - mpi4jax
