231103-jax/readme.tex
\subsubsection{Different shardings}
\label{sec:orgb51b3f0}

\begin{minted}[]{python}
xs = jax.device_put(xs, sharding.reshape(1, -1))

jax.debug.visualize_array_sharding(xs)
\end{minted}

\begin{minted}[]{python}
xs = jax.device_put(xs, sharding.reshape(dc // 2, -1))
jax.debug.visualize_array_sharding(xs)
\end{minted}
\subsubsection{Performance}
\label{sec:org2471f3d}

\begin{minted}[]{python}
xs = jax.device_put(xs, sharding.reshape(dc // 2, -1))
xsc0 = jax.device_put(xs, jax.devices()[0])
import time

cos = jax.jit(jnp.cos)
cos(xsc0).block_until_ready()
cos(xs).block_until_ready()

t1 = time.time()
for _ in range(20):
  r = cos(xsc0).block_until_ready()
t2 = time.time()

t3 = time.time()
for _ in range(20):
  rr = cos(xs).block_until_ready()
t4 = time.time()

cos = jax.pmap(jnp.cos)

pxs = xsc0.reshape(dc, -1, xsc0.shape[-1])

t5 = time.time()
for _ in range(20):
  rrr = cos(pxs).block_until_ready()
t6 = time.time()

print("In single device: ", t2 - t1)
print("In multi device: ", t4 - t3)
print("In multi device pmap: ", t6 - t5)
\end{minted}
\subsubsection{Use sharding with \texttt{jit}}
\label{sec:orgee20554}

\begin{minted}[]{python}
xs = jax.device_put(xs, sharding.reshape(dc, -1))

def f(x):
  return jnp.sin(x)


# in with None, out with (dc, 1)

print("before:")
jax.debug.visualize_array_sharding(xs)

out = jax.jit(f, in_shardings=sharding.reshape(dc, -1), out_shardings=sharding.reshape(-1, dc))(xs)
print("after:")
jax.debug.visualize_array_sharding(out)
\end{minted}
\section{JAX echosystem}
\label{sec:orgad0dd02}

\begin{itemize}
\item JAX
\item NN library
\begin{itemize}
\item Flax  (Google)
\item Haiku  (Deepmind)
\item Trax  (Google brain)
\item HuggingFace (Flax)
\item keras
\item jraph  (GNN)
\item RLax (Deepmind, RL)
\item Coax (Microsoft, RL)
\end{itemize}
\item Optimizer
\begin{itemize}
\item jaxopt
\item optax
\end{itemize}
\item Others
\begin{itemize}
\item orbax-checkpoint
\item jax-md  (molecular dynamics)
\item mpi4jax
\end{itemize}
\end{itemize}
\end{document}
